{
  "backend/main.mo": "Main Motoko actor implementing the backend canister with CRUD operations for products, suppliers, and orders, including search, filtering, profit calculation, and order status management.",
  "feature_evidence.json": "Feature evidence report mapping five main features (product catalog, order management, supplier management, dashboard metrics, profit calculation) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing pages, components, hooks, and utilities for the DropShip Pro application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode color tokens for the application theme.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for Dashboard, Products, Orders, and Suppliers pages wrapped in a Layout component.",
  "frontend/src/components/AddProductForm.tsx": "Form component for adding new products with fields for name, description, supplier selection, wholesale price, and retail price using React hooks and shadcn/ui components.",
  "frontend/src/components/AddSupplierForm.tsx": "Form component for adding new suppliers with name and contact information fields, using the useAddSupplier hook for backend integration.",
  "frontend/src/components/CreateOrderForm.tsx": "Form component for creating new orders with product selection, quantity input, and customer name fields. Uses React hooks for state management and mutations to submit order data.",
  "frontend/src/components/Layout.tsx": "Main layout component providing navigation header with dashboard, products, orders, and suppliers links, plus a footer with branding. Uses TanStack Router for navigation and active route highlighting.",
  "frontend/src/components/MetricCard.tsx": "Reusable card component for displaying dashboard metrics with title, value, icon, optional description, and trend indicator.",
  "frontend/src/components/OrderCard.tsx": "Displays individual order details including customer info, product, quantity, pricing, profit calculation, and status with dropdown for updating order status.",
  "frontend/src/components/OrderStatusBadge.tsx": "Badge component that displays order status (pending, processing, shipped, delivered) with appropriate styling variants.",
  "frontend/src/components/ProductCard.tsx": "Card component displaying product information including name, description, supplier, wholesale/retail prices, and calculated profit margin.",
  "frontend/src/components/ProductSearch.tsx": "Search input component with icon for filtering products by name or description.",
  "frontend/src/components/SupplierCard.tsx": "Card component showing supplier details including name, contact info, and list of associated products with count badge.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing the backend actor instance with Internet Identity authentication, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useDashboardMetrics.ts": "Hook aggregating data from products, orders, and suppliers to calculate dashboard metrics like total products, active orders, pending orders, revenue, and supplier count.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for fetching all orders, creating new orders, and updating order status with automatic cache invalidation.",
  "frontend/src/hooks/useProducts.ts": "Exports hooks for fetching products with debounced search, retrieving individual products by ID, and adding new products with cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Minimal file that imports useActor and notes that feature-specific query hooks are organized in separate files.",
  "frontend/src/hooks/useSuppliers.ts": "Provides hooks for fetching all suppliers, individual suppliers by ID, supplier products, and adding new suppliers with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, muted, accent, destructive, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying business metrics (products, orders, revenue) with MetricCard components, quick stats, and a getting started guide.",
  "frontend/src/pages/Orders.tsx": "Orders page with status filtering, order creation dialog, and displays OrderCard components for each order with empty state handling.",
  "frontend/src/pages/Products.tsx": "Products page with search functionality, add product dialog, and displays ProductCard components in a grid with loading and empty states.",
  "frontend/src/pages/Suppliers.tsx": "Suppliers page with add supplier dialog that displays SupplierCard components in a grid with loading and empty state handling.",
  "frontend/src/utils/profitCalculations.ts": "Utility functions for calculating profit margin between wholesale and retail prices, and total order profit based on quantity.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter font family, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for DropShip Pro application defining six implemented features: product catalog, order management, supplier management, dashboard with metrics, profit calculation, and modern UI design with warm color palette."
}